
&НаКлиенте
Процедура ОплатаСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	фуОбщийКлиент.РасчетКомиссииПриИзмененииСуммы(ТекущиеДанные,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаДополнительныеРасходыПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	фуОбщийКлиент.РасчетКомиссииПриИзмененииДополнительныеРасходы(ТекущиеДанные,Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполненияКлючевыхРеквизитовДляШаблонаЗаполнения(Отказ)
	
	РасчетныйСчет = фуОбщийСервер.ПолучитьРасчетныйСчетДокументаОперация(Объект);
	Если Не ЗначениеЗаполнено(РасчетныйСчет) Тогда
		фуОбщийКлиентСервер.СообщитьПользователю("Внимание! Не задан расчетный счет.");
		Отказ = Истина;	
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Объект.Комментарий) Тогда
		фуОбщийКлиентСервер.СообщитьПользователю("Внимание! Не задан комментарий.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьШаблон(Команда)
	
	Отказ = Ложь;
	ПроверкаЗаполненияКлючевыхРеквизитовДляШаблонаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = фуОбщийСервер.ПолучитьСтруктуруЗаполненияДокумента();
	ЗаполнитьЗначенияСвойств(ПараметрыФормы,Объект);
	РасчетныйСчет = ПолучитьРасчетныйСчетНаСервере();
	ПараметрыФормы.РасчетныйСчет = РасчетныйСчет;
	ПараметрыФормы.СтрокаПоиска = Объект.Комментарий;
	
	ОткрытьФорму("РегистрСведений.фмАналитикиЗаполненияДокументаОперация.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРасчетныйСчетНаСервере()
	
	Возврат фуОбщийСервер.ПолучитьРасчетныйСчетДокументаОперация(Объект);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоШаблону(Команда)
	
	Отказ = Ложь;
	ПроверкаЗаполненияКлючевыхРеквизитовДляШаблонаЗаполнения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоШаблонуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоШаблонуНаСервере()
	
	РасчетныйСчет = фуОбщийСервер.ПолучитьРасчетныйСчетДокументаОперация(Объект);
	ДанныеДляЗаполненияДокумента = фуОбщийСервер.ПолучитьДанныеДляЗаполненияДокумента(РасчетныйСчет,Объект.Комментарий);
	Если ДанныеДляЗаполненияДокумента = Неопределено Тогда
		фуОбщийКлиентСервер.СообщитьПользователю("Внимание! Не найден подходящий шаблон.");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект,ДанныеДляЗаполненияДокумента);
	//ЗаполнитьРасчетныйСчетДокументаНаСервере(ДанныеДляЗаполненияДокумента.РасчетныйСчет);
	фуОбщийСервер.ЗаполнитьРасчетныйСчетДокументаОперацияНаСервере(Объект,
	 															   ДанныеДляЗаполненияДокумента.РасчетныйСчет);
	фуОбщийКлиентСервер.СообщитьПользователю("Документ заполнен по шаблону. Расчетный счет: "
	                                        +ДанныеДляЗаполненияДокумента.РасчетныйСчет
											+", контекст поиска: "+ДанныеДляЗаполненияДокумента.СтрокаПоиска
											+".");

КонецПроцедуры

