
// Функция - Подмена наименования
//
// Параметры:
//  ТекущееНаименование     - строка, текущее наименование элемента 
//  ТаблицаНаименований     - таблица значений, наименованя на иностранном языке
//  Язык                    - иностранный язык
// 
// Возвращаемое значение:
//   - строка, альтернативное наименование 
//
Функция ПодменаНаименования(ТекущееНаименование,ТаблицаНаименований,Язык) Экспорт
    
    НаименованиеСтрока = ТекущееНаименование;
    ПоискСтруктура = Новый Структура("Наименование",ТекущееНаименование);
    
    Возврат НаименованиеСтрока;         
    
КонецФункции

// Функция - Получить наименования на иностранном языке
//
// Параметры:
//  СправочникИмя     - строка, имя справочника метаданные 
// 
// Возвращаемое значение:
//   - таблица значений. 
//
Функция ПолучитьНаименованияНаИностранномЯзыке(СправочникИмя) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	фуСтруктураОтчётаДДС.Ссылка КАК Ссылка,
        |	фуСтруктураОтчётаДДС.Наименование КАК Наименование
        |ИЗ
        |	Справочник.фуСтруктураОтчётаДДС КАК фуСтруктураОтчётаДДС";
    
    Если СправочникИмя = "" Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст,"фуСтруктураОтчётаДДС",СправочникИмя);
    КонецЕсли; 
    
    тз = Запрос.Выполнить().Выгрузить();
    тз.Индексы.Добавить("Наименование");    

    Возврат тз;
		
КонецФункции

// Функция - Язык текущего пользователя
// 
// Возвращаемое значение:
//   - язык текущего пользователя
//
Функция ЯзыкТекущегоПользователя() Экспорт
    
    Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Язык; 
    
КонецФункции

// Параметры:
//  Данные                  - Структура - Содержит данные справочника
//  Представление           - Строка    - Представление строки при отображении
//  СтандартнаяОбработка    - Булево    - Признак стандартной обработки
//
Процедура УстановитьПредставлениеПоЯзыкуПользователя(Данные, Представление, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры
