///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
    
    ВремяОповещения = Строка(ТекущаяДата()+60*15);
    
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;
	ВозвращаемыеСведения.Вставить("ВремяОповещения", ВремяОповещения);
	ВозвращаемыеСведения.Вставить("ТекстСообщения", ТекстСообщения);
	ВозвращаемыеСведения.Вставить("ТекстСообщенияНаИспанском", ТекстСообщенияНаИспанском);
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗадатьЗначенияПараметовНаФорме(ЧасыЧисло,МинутыЧисло)
    
    ВремяОповещения = Дата(Год(ТекущаяДата()),Месяц(ТекущаяДата()),День(ТекущаяДата()),ЧасыЧисло,МинутыЧисло,0); 
    ТекстСообщения = "Внимание! Сегодня "
                        +Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")
                        +" в "
                        +Формат(ВремяОповещения,"ДФ=ЧЧ:мм")
                        +" будет обновлена база данных 1с. Всех к этому времени прошу выйти из 1с."
                        +" Время обновления около 15 минут.";
    ТекстСообщенияНаИспанском =  
                     " ¡Atención! Hoy "
                        +Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy")
                        +" a "
                        +Формат(ВремяОповещения,"ДФ=ЧЧ:мм")
                        +" se actualizará la base de datos de 1C. para este momento, por favor, salga de 1C."
                        +" Tiempo de actualización de unos 15 minutos.";
    ВремяОповещения = ВремяОповещения - 60*20; // Предупредим за 20 минут.                        

КонецПроцедуры    

&НаКлиенте
Процедура ПерезагрузкаСервераВ1845(Команда)
    ЗадатьЗначенияПараметовНаФорме(18,45);
КонецПроцедуры

&НаКлиенте
Процедура ПерезагрузкаСервераВ1400(Команда)
    ЗадатьЗначенияПараметовНаФорме(14,0);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакыть(Команда)
    
    ЭтаФорма.Закрыть(ПоместитьИзмененныеДанныеВоВременноеХранилище());
    
КонецПроцедуры

#КонецОбласти
