
&НаСервере
Процедура СтатьяЗатратПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.СтатьяЗатрат.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьяЗатратПриИзменении(Элемент)
	СтатьяЗатратПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитовНаФорме()
	
	Элементы.СтатьяЗатрат.Доступность = Не Объект.ЭтоГруппаЗаголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоГруппаЗаголовокПриИзменении(Элемент)
	
	УстановитьДоступностьРеквизитовНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьРеквизитовНаФорме();
	
КонецПроцедуры
