
#Область о // Стандартные процедуры и функции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
    фуОбщийСервер.УстановитьДоступоностьРеквизитовНаФорме(Элементы,Объект.Ссылка);    
	// +++ Чесноков М.С. 2021-09-16 F1-121
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
	// --- Чесноков М.С. 2021-09-16 F1-121
	
КонецПроцедуры    

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	// +++ Чесноков М.С. 2021-09-16 F1-121
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
	ЗагрузитьДанныеПоСотрудникуНаСервере(Объект.Сотрудник);
	// --- Чесноков М.С. 2021-09-16 F1-121

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСканДокумента(Команда)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	фуКадровыйУчетКлиент.ОткрытьФорму_фмСканыДокументовКадры(Объект,,);
	// --- Чесноков М.С. 2021-09-22 F1-121
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	Если ИмяСобытия = "ЗакрытиеФормыПриДобавленииНовогоСканаДокумента"  Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ДобавитьСтрокуВТЧНаСервере(Параметр);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- Чесноков М.С. 2021-09-22 F1-121

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТЧНаСервере(Параметр)
	
	НоваяСтрока = Объект.СканыДокументовКадры.Добавить();
	НоваяСтрока.СканДокумента = Параметр;
	
КонецПроцедуры

&НаКлиенте
Процедура СканыДокументовКадрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СканДокумента) Тогда
		
		фуКадровыйУчетКлиент.ОткрытьФорму_фмСканыДокументовКадры(Объект,Элемент.ТекущиеДанные.СканДокумента);
		
	КонецЕсли; 
	// --- Чесноков М.С. 2021-09-22 F1-121 

КонецПроцедуры

#КонецОбласти 
 
#Область о // Загрузка кадровых данных

// +++ Чесноков М.С. 2021-09-16 F1-121
Процедура ЗагрузитьДанныеПоСотрудникуНаСервере(СотрудникСсылка)
	
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(Объект.ДатаКадровогоИзменения) Тогда
		МоментВремени = НачалоДня(Объект.ДатаКадровогоИзменения)-1;
	Иначе
		МоментВремени = ТекущаяДата();
	КонецЕсли;	
	
	ДанныеПоСотруднику = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(СотрудникСсылка,МоментВремени); 
	ЗаполнитьЗначенияСвойств(Объект,ДанныеПоСотруднику);
	
КонецПроцедуры
// --- Чесноков М.С. 2021-09-16 F1-121

// +++ Чесноков М.С. 2021-09-16 F1-121
Процедура ЗагрузитьИсториюПоКадровымДаннымНаСервере(СотрудникСсылка)
	
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(Объект.ДатаКадровогоИзменения) Тогда
		МоментВремени = НачалоДня(Объект.ДатаКадровогоИзменения)-1;
	Иначе
		МоментВремени = ТекущаяДата();
	КонецЕсли;	
	
	ДанныеПоСотруднику = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(СотрудникСсылка,МоментВремени); 
	
	// +++ Чесноков М.С. 2022-01-28 F1-183
	Для каждого ЭлементСтруктуры Из ДанныеПоСотруднику Цикл
		
		ИмяРеквизитаФормы = "мИстория"+ЭлементСтруктуры.Ключ;
		Если фуОбщийКлиентСервер.ЕстьСвойство(ЭтаФорма,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;
	// --- Чесноков М.С. 2022-01-28 F1-183

	// +++ Чесноков М.С. 2021-11-30 F1-152
	Если ДанныеПоСотруднику.Свойство("ОкладОфициальный") Тогда
		мИсторияОкладОфициальный        = ДанныеПоСотруднику.ОкладОфициальный;	
	КонецЕсли; 
	Если ДанныеПоСотруднику.Свойство("ОкладУправленческий") Тогда
		мИсторияОкладУправленческий     = ДанныеПоСотруднику.ОкладУправленческий;	
	КонецЕсли; 
	// --- Чесноков М.С. 2021-11-30 F1-152 
	
КонецПроцедуры
// --- Чесноков М.С. 2021-09-16 F1-121 

#КонецОбласти 


