
Процедура ПередЗаписью(Отказ)
    
    Если Не фуОбщийСервер.ЕстьДетиУСправочника(ЭтотОбъект.Ссылка,"фуСтруктураОтчётаОПУ") Тогда
    	ЭтотОбъект.ЭтоГруппаЗаголовок = Ложь;
    КонецЕсли; 

    Если ЭтотОбъект.ЭтоГруппаЗаголовок Тогда
		ЭтотОбъект.СтатьяЗатрат = Справочники.фуСтатьиЗатрат.ПустаяСсылка();	
	КонецЕсли;    
	
	ЭтотОбъект.УровеньВложенности = ЭтотОбъект.Уровень();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
    
    фуОбщийСервер.УстановитьЭтоГруппаУРодителей(ЭтотОбъект.Родитель);
    
КонецПроцедуры



