
#Область о //Обработчики событий - справочники

Процедура ПередЗаписью_Справочники(Источник, Отказ) Экспорт
    
    Если Источник.ЭтоГруппа Тогда
    	Возврат;
    КонецЕсли; 
    
	фуОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если Источник.ДополнительныеСвойства.фуЭтоНовый Тогда
		фуОбщийСервер.ЗаписатьРеквизитВОбъект(Источник,"Ответственный",ТекущийПользователь);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область о //Обработчики событий - документы

Процедура ПередЗаписью_Документы(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	фуОбщийСервер.ДобавитьПризнакЭтоНовый(Источник);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если Источник.ДополнительныеСвойства.фуЭтоНовый Тогда
		фуОбщийСервер.ЗаписатьРеквизитВОбъект(Источник,"Ответственный",ТекущийПользователь);
	КонецЕсли;
	
КонецПроцедуры

Процедура КадровыеДокументы_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	фуОбщийСервер.ЗаписьСправочника_Сотрудник(Отказ,Неопределено,Источник);	
КонецПроцедуры

Процедура КадровыеДокументы_ПриЗаписи(Источник, Отказ) Экспорт
	фуОбщийСервер.ЗаписьСправочника_Сотрудник(Отказ,Неопределено,Источник);		
КонецПроцедуры

#КонецОбласти


