
#Область о //Служебные процедуры и функции:

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКадровыеДанныеСорудника();
    
    // Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		ДополнительныеПараметрыКонтактнойИнформации = МодульУправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
		ДополнительныеПараметрыКонтактнойИнформации.ТипПомещения = "Офис";
		МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, ДополнительныеПараметрыКонтактнойИнформации);
	КонецЕсли;
	
	// +++ Чесноков М.С. 2021-08-27 F1-117
	фуОбщийСервер.УстановитьДоступоностьРеквизитовНаФорме(Элементы,Объект.Ссылка);
	// --- Чесноков М.С. 2021-08-27 F1-117 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    
    // Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
    
    // Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    // Контактаная информация:
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКадровыеДанныеСорудника()
    
    ЭтотОбъект.Прочитать();
    
	КадровыеДанныеСотрудника = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(Объект.Ссылка,ТекущаяДата());
	
	// +++ Чесноков М.С. 2022-01-28 F1-183
	Для каждого ЭлементСтруктуры Из КадровыеДанныеСотрудника Цикл
		
		ИмяРеквизитаФормы = "м"+ЭлементСтруктуры.Ключ;
		Если фуОбщийКлиентСервер.ЕстьСвойство(Элементы,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;
	мПодразделениеПуть 		= фуКадровыйУчетСервер.ПолучитьПолныйПутьКПодразделению(мОтдел);
	// --- Чесноков М.С. 2022-01-28 F1-183
    
КонецПроцедуры

&НаКлиенте
Процедура РуководителиСотрудникаСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РуководителиСотрудникаУдалить.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		КадровыеДанныеСотрудника = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(ТекущиеДанные.Сотрудник,ТекущаяДата());
		ТекущиеДанные.Должность = КадровыеДанныеСотрудника.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КадровыеДокументыСотрудника(Команда)
    
	УсловияОтбора = новый Структура();
	УсловияОтбора.Вставить("Сотрудник",Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
    
    ОткрытьФорму("ЖурналДокументов.фмКадровыеДокументы.ФормаСписка",ПараметрыФормы,ЭтаФорма);
    
КонецПроцедуры

&НаКлиенте
Процедура СканыДокументовСотрудника(Команда)
    
    УсловияОтбора = новый Структура();
	УсловияОтбора.Вставить("Сотрудник",Объект.Ссылка);
	УсловияОтбора.Вставить("ПометкаУдаления",Ложь);
	ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
    
    ОткрытьФорму("Справочник.фмСканыДокументов.Форма.ФормаСписка",ПараметрыФормы,ЭтаФорма);
    
КонецПроцедуры

&НаКлиенте
Процедура КадровыеСканыДокументов(Команда)
	
	// +++ Чесноков М.С. 2021-09-23 F1-121
	УсловияОтбора = новый Структура();
	УсловияОтбора.Вставить("Сотрудник",Объект.Ссылка);
	УсловияОтбора.Вставить("ПометкаУдаления",Ложь);
	ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
                                          
    ОткрытьФорму("Справочник.фмСканыДокументовКадры.Форма.ФормаСписка",ПараметрыФормы,ЭтаФорма);
	// --- Чесноков М.С. 2021-09-23 F1-121 
	
КонецПроцедуры

// +++ Чесноков М.С. 2021-08-17 F1-113
&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	КонецЕсли;
КонецПроцедуры
// --- Чесноков М.С. 2021-08-17 F1-113 

// +++ Чесноков М.С. 2021-08-17 F1-113
&НаКлиенте
Процедура ОбновитьИнформацию(Команда)
	
    ЗаполнитьКадровыеДанныеСорудника();
	
	// +++ Чесноков М.С. 2021-08-27 F1-117
	ОбновитьИнформациюНаСервере();
	// --- Чесноков М.С. 2021-08-27 F1-117 

КонецПроцедуры
// --- Чесноков М.С. 2021-08-17 F1-113 

// +++ Чесноков М.С. 2021-08-27 F1-117
Процедура ОбновитьИнформациюНаСервере()

	фуОбщийСервер.УстановитьДоступоностьРеквизитовНаФорме(Элементы,Объект.Ссылка);

КонецПроцедуры
// --- Чесноков М.С. 2021-08-27 F1-117 

#КонецОбласти 

#Область о //БСП:

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		
		ПараметрыОткрытия = Новый Структура;
		
		Отбор = Новый Структура("ИмяРеквизита", Элемент.Имя);
		Строки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
		//Если ДанныеСтроки <> Неопределено Тогда
		//	ДобавитьСтрануВПараметрыОткрытия(ПараметрыОткрытия, ДанныеСтроки.Вид, Объект.СтранаРегистрации);
		//КонецЕсли;
		
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент,, СтандартнаяОбработка, ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформациейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент");
		МодульУправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#КонецОбласти 
