
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ОбновитьСписокНаСервере(Ложь);    
КонецПроцедуры

&НаКлиенте
Процедура мОтображатьУволенныхПриИзменении(Элемент)
    ОбновитьСписокНаСервере(мОтображатьУволенных);
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере(ОтображатьУволенных);
    
    ПользовательскийОтбор = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
    ПользовательскийОтбор.Элементы.Очистить();
    
    ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Уволен");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.Использование = Не ОтображатьУволенных;
    ЭлементОтбора.ПравоеЗначение = ОтображатьУволенных;
    
    Элементы.Список.Обновить();
    
КонецПроцедуры

