
#Область о // Служебные процедуры и функции:

&НаСервере
Процедура ЗаписьДвижений_фуОстаткиНаРасчетныхСчетах(Отказ,Режим)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	//
	сОсновныеВалюты = фуОперацииСВалютамиКлиентСервер.ПолучитьОсновныеВалютыСервер();
	//
	
	// регистр фмОстаткиНаРасчетныхСчетах:
	Движения.фуОстаткиНаРасчетныхСчетах.Записывать = Истина;
	Для Каждого ТекСтрокаОплата Из Оплата Цикл
		
		ВалютаСчета = ТекСтрокаОплата.РасчетныйСчет.ВалютаСчета; 
		Если Не фуОбщийКлиентСервер.ПроверкаЗаполненияВалютыСчета(ВалютаСчета) Тогда
			
			фуОбщийКлиентСервер.ВывестиСообщениеОНеЗаполненнойВалютеСчета(ВалютаСчета,ТекСтрокаОплата,ЭтотОбъект,"Оплата");
			Отказ = Истина;
			
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			Если ТекСтрокаОплата.Сумма <> 0 Тогда 
				Движение = Движения.фуОстаткиНаРасчетныхСчетах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ЭтотОбъект.Дата;
				Движение.РасчетныйСчет = ТекСтрокаОплата.РасчетныйСчет;
				Движение.Сумма = ТекСтрокаОплата.Сумма;
				Движение.Основание = ЭтотОбъект.Комментарий;
			КонецЕсли;	
				
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область о // Стандартные процедуры и функции:

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)

	ЗаписьДвижений_фуОстаткиНаРасчетныхСчетах(Отказ,Режим);
	
КонецПроцедуры

#КонецОбласти