
Процедура ОткрытьФорму_фуСканыДокументовКадры(Объект,СканДокумента = Неопределено,Отказ = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сообщить("Внимание! Перед записью скана необходимо записать документ!");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		
		Сообщить("Внимание! Перед записью скана необходимо выбрать сотрудника!");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Сотрудник",Объект.Сотрудник);
	Если Не ЗначениеЗаполнено(СканДокумента) Тогда
		ПараметрыФормы.Вставить("КадровыйДокумент",Объект.Ссылка);
	Иначе
		ПараметрыФормы.Вставить("Ключ", СканДокумента);
	КонецЕсли; 
	
	ОткрытьФорму("Справочник.фуСканыДокументовКадры.Форма.ФормаЭлемента",ПараметрыФормы,Объект);

КонецПроцедуры
