
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы ФинансовыйУчет: 1.0.
//
/////////////////////////////////////////////////////////////////////////////

#Область о //Последовательность действий при добавлении нового обновления ИБ:

//* Добавить в менеджере объекта экспортную процедуру с именем ИмяПроцедуры_11_0_0_0;
//* В этом модуле в процедуре ПриДобавленииОбработчиковОбновления указать обработчик
//* В этом модуле в процедуре ПриДобавленииПодсистемы установить новый номер конфигурации
//*  В этом модуле в процедуре ПриПодготовкеМакетаОписанияОбновлений указать новый номер
//версии конфигурации;	
//* Поднять номер версии в свойствах конфигураци; 
//см. п. 1;
//* В общем макете ОписаниеИзмененийСистемы, добавить описание изменения с нужно версией;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
    
    Описание.Имя = "ФинансовыйУчет";
	Описание.Версия = "1.0.1.15";
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
    
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.15";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаДДС.ПервоночальноеЗаполнениеСправочника_1_0_1_15";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.15";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаОПУ.ПервоночальноеЗаполнениеСправочника_1_0_1_15";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;

	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.14";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаДДС.ПерезаписатьДанныеСправочников_1_0_1_14";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.14";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаОПУ.ПерезаписатьДанныеСправочников_1_0_1_14";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;                	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.13";                                
	Обработчик.Процедура = "Константы.фуВалютаУправленческогоУчета.УстановкаВалютыУправленческогоУчета_1_0_1_13";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.12";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаДДС.ПервоночальноеЗаполнениеСправочника_1_0_1_12";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.11";
	Обработчик.Процедура = "Справочники.фуСтруктураОтчётаОПУ.ПервоночальноеЗаполнениеСправочника_1_0_1_11";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	
	// +++ Чесноков М.С. 2021-09-21 F1-121
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыФинансовыйУчет.ОбновитьПредопределенныеВидыКонтактнойИнформации";
	Обработчик.ВыполнятьВГруппеОбязательных = Истина;
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Приоритет = 99;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыФинансовыйУчет.ОбновитьИспользованиеКонтактнойИнформации";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.НачальноеЗаполнение = Истина;
	// --- Чесноков М.С. 2021-09-21 F1-121 
	  	
КонецПроцедуры

Процедура ПередОбновлениемИнформационнойБазы() Экспорт
КонецПроцедуры

Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
	Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Макет) Экспорт
                                                    
   	НомераВерсийДляОтображенияМассив = Новый Массив;

	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.15");
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.14");
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.13");
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.12");
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.11");

	// +++ Чесноков М.С. 2021-11-23 F1-148
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.10");
	// --- Чесноков М.С. 2021-11-23 F1-148 

	// +++ Чесноков М.С. 2021-10-06 F1-122
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.9");
	// --- Чесноков М.С. 2021-10-06 F1-122 
	
	// +++ Чесноков М.С. 2021-09-21 F1-121 
    НомераВерсийДляОтображенияМассив.Добавить("1.0.1.8");
	// --- Чесноков М.С. 2021-09-21 F1-121 
	
    // +++ Чесноков М.С. 2021-07-29 F1-100
    НомераВерсийДляОтображенияМассив.Добавить("1.0.1.7");
    // --- Чесноков М.С. 2021-07-29 F1-100  

    // +++ Чесноков М.С. 2021-04-01 F1-55
    НомераВерсийДляОтображенияМассив.Добавить("1.0.1.6");
    // --- Чесноков М.С. 2021-04-01 F1-55 
    
    // +++ Чесноков М.С. 2021-03-26 F1-54
    НомераВерсийДляОтображенияМассив.Добавить("1.0.1.5");
    // --- Чесноков М.С. 2021-03-26 F1-54 
    
    // +++ Чесноков М.С. 2020-12-21 F1-15
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.4");
	НомераВерсийДляОтображенияМассив.Добавить("1.0.1.3");
    // --- Чесноков М.С. 2020-12-21 F1-15
    
    НомераВерсийДляОтображенияМассив.Добавить("1.0.1.2");
	
	Макет = ДокументОписаниеОбновлений(НомераВерсийДляОтображенияМассив);
             
КонецПроцедуры

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
КонецПроцедуры

Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Заполнение пустой ИБ

////////////////////////////////////////////////////////////////////////////////
// Обновление ИБ

Процедура ОбновитьИспользованиеКонтактнойИнформации() Экспорт
	
КонецПроцедуры	

Процедура ОбновитьПредопределенныеВидыКонтактнойИнформации() Экспорт

	// +++ Чесноков М.С. 2021-09-21 F1-121
	// Справочник "Сотрудники (ФинансовыйУчет)"
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.Наименование = "Адрес фактического проживания";
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	// --- Чесноков М.С. 2021-09-21 F1-121 

КонецПроцедуры

// Вывести описания изменений в указанной версии.
//
// Параметры:
//  НомерВерсии  - Строка - номер версии, для которого выводится описание из макета
//                          табличного документа МакетОписаниеОбновлений в табличный документ.
//                          ДокументОписаниеОбновлений.
//
Процедура ВывестиОписаниеИзменений(Знач НомерВерсии, ДокументОписаниеОбновлений, МакетОписаниеОбновлений)
	
	Номер = СтрЗаменить(НомерВерсии, ".", "_");
	
	Если МакетОписаниеОбновлений.Области.Найти("Шапка_" + Номер) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Шапка_" + Номер));
	ДокументОписаниеОбновлений.НачатьГруппуСтрок("Версия_" + Номер);
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Версия_" + Номер));
	ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));
	
КонецПроцедуры

// Формирует табличный документ с описанием изменений в версиях,
// которые соответствуют переданному списку версий Разделы.
//
Функция ДокументОписаниеОбновлений(Знач Разделы) 
	
	ДокументОписаниеОбновлений = Новый ТабличныйДокумент();
	Если Разделы.Количество() = 0 Тогда
		Возврат ДокументОписаниеОбновлений;
	КонецЕсли;
	
	МакетОписаниеОбновлений = Метаданные.ОбщиеМакеты.Найти("фуОписаниеИзмененийСистемы");
	Если МакетОписаниеОбновлений <> Неопределено Тогда
		МакетОписаниеОбновлений = ПолучитьОбщийМакет(МакетОписаниеОбновлений);
	Иначе
		Возврат Новый ТабличныйДокумент();
	КонецЕсли;
	
	Для Каждого Версия Из Разделы Цикл
		
		ВывестиОписаниеИзменений(Версия, ДокументОписаниеОбновлений, МакетОписаниеОбновлений);
		
	КонецЦикла;
	
	Возврат ДокументОписаниеОбновлений;
	
КонецФункции

#КонецОбласти
